app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @markets = Market.all

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @mymarket = Market.find(params[:id])